In [1]:
#Import Main Dependencies
import pandas as pd
from sqlalchemy import create_engine
from unicodedata import normalize

In [2]:
# #Read in the emissions data file 
# test_file = "resources/test.csv"
# test_df = pd.read_csv(test_file)
# test_df.head()

In [3]:
#Read in the emissions data file 
transactions_file = "resources/transactions.csv"
trans_df = pd.read_csv(transactions_file)
trans_df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [4]:
# check data types for SQL compatibility 
trans_df.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

In [5]:
trans_df['date'] = pd.to_datetime(trans_df['date'])
trans_df.dtypes

date            datetime64[ns]
store_nbr                int64
transactions             int64
dtype: object

In [6]:
earthquake = (trans_df['date'] >= '2016-04-16') & (trans_df['date'] <= '2016-05-16')
# mask = (df['date'] > start_date) & (df['date'] <= end_date)
eq_df = trans_df.loc[earthquake]
eq_df.head()

            date  store_nbr  transactions
57846 2016-04-16          1          1333
57847 2016-04-16          2          2088
57848 2016-04-16          3          3648
57849 2016-04-16          4          1613
57850 2016-04-16          5          1113

In [7]:
eq_df.tail()

            date  store_nbr  transactions
59484 2016-05-16         49          2623
59485 2016-05-16         50          2016
59486 2016-05-16         51          1543
59487 2016-05-16         53          1434
59488 2016-05-16         54           755

In [8]:
len(eq_df)

1643

In [9]:
#Read in the emissions data file 
stores_file = "resources/stores.csv"
stores_df = pd.read_csv(stores_file)
stores_df.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [10]:
stores_df.dtypes

store_nbr     int64
city         object
state        object
type         object
cluster       int64
dtype: object

In [11]:
eq_store_merged = pd.merge(stores_df, eq_df, on ='store_nbr')
eq_store_merged.head()

   store_nbr   city      state type  cluster       date  transactions
0          1  Quito  Pichincha    D       13 2016-04-16          1333
1          1  Quito  Pichincha    D       13 2016-04-17           575
2          1  Quito  Pichincha    D       13 2016-04-18          2133
3          1  Quito  Pichincha    D       13 2016-04-19          2079
4          1  Quito  Pichincha    D       13 2016-04-20          2073

In [22]:
len(eq_store_merged)

1643

In [12]:
eq_store_merged.dtypes

store_nbr                int64
city                    object
state                   object
type                    object
cluster                  int64
date            datetime64[ns]
transactions             int64
dtype: object

In [13]:
#Read in the emissions data file 
holiday_file = "resources/holidays_events.csv"
holiday_df = pd.read_csv(holiday_file)
holiday_df.tail()

           date        type    locale locale_name description  transferred
345  2017-12-22  Additional  National     Ecuador   Navidad-3        False
346  2017-12-23  Additional  National     Ecuador   Navidad-2        False
347  2017-12-24  Additional  National     Ecuador   Navidad-1        False
348  2017-12-25     Holiday  National     Ecuador     Navidad        False
349  2017-12-26  Additional  National     Ecuador   Navidad+1        False

In [14]:
len(holiday_df)

350

In [15]:
holiday_df.dtypes

date           object
type           object
locale         object
locale_name    object
description    object
transferred      bool
dtype: object

In [16]:
holiday_df['date'] = pd.to_datetime(holiday_df['date'])
holiday_df.dtypes

date           datetime64[ns]
type                   object
locale                 object
locale_name            object
description            object
transferred              bool
dtype: object

In [29]:
#drop rows that contain specific 'value' in 'column_name'
cleaned_hol = holiday_df[holiday_df['transferred'] == False]

In [30]:
# cleaned_holiday= holiday_df.loc[holiday_df["transferred"] != "FALSE"]
len(cleaned_hol)

338

In [31]:
holiday = (cleaned_hol['date'] >= '2016-04-16') & (cleaned_hol['date'] <= '2016-05-16')
# mask = (df['date'] > start_date) & (df['date'] <= end_date)
hol_df = cleaned_hol.loc[holiday]
hol_df.head()

          date   type    locale locale_name         description  transferred
219 2016-04-16  Event  National     Ecuador    Terremoto Manabi        False
220 2016-04-17  Event  National     Ecuador  Terremoto Manabi+1        False
221 2016-04-18  Event  National     Ecuador  Terremoto Manabi+2        False
222 2016-04-19  Event  National     Ecuador  Terremoto Manabi+3        False
223 2016-04-20  Event  National     Ecuador  Terremoto Manabi+4        False

In [32]:
eq_store_holiday = pd.merge(eq_store_merged, hol_df, on ='date')
eq_store_holiday.head()

,store_nbr,city,state,type_x,cluster,date,transactions,type_y,locale,locale_name,description,transferred
0,1,Quito,Pichincha,D,13,2016-04-16,1333,Event,National,Ecuador,Terremoto Manabi,False
1,2,Quito,Pichincha,D,13,2016-04-16,2088,Event,National,Ecuador,Terremoto Manabi,False
2,3,Quito,Pichincha,D,8,2016-04-16,3648,Event,National,Ecuador,Terremoto Manabi,False
3,4,Quito,Pichincha,D,9,2016-04-16,1613,Event,National,Ecuador,Terremoto Manabi,False
4,5,Santo Domingo,Santo Domingo de los Tsachilas,D,4,2016-04-16,1113,Event,National,Ecuador,Terremoto Manabi,False

In [33]:
eq_store_holiday.tail()

,store_nbr,city,state,type_x,cluster,date,transactions,type_y,locale,locale_name,description,transferred
1903,49,Quito,Pichincha,A,11,2016-05-16,2623,Event,National,Ecuador,Terremoto Manabi+30,False
1904,50,Ambato,Tungurahua,A,14,2016-05-16,2016,Event,National,Ecuador,Terremoto Manabi+30,False
1905,51,Guayaquil,Guayas,A,17,2016-05-16,1543,Event,National,Ecuador,Terremoto Manabi+30,False
1906,53,Manta,Manabi,D,13,2016-05-16,1434,Event,National,Ecuador,Terremoto Manabi+30,False
1907,54,El Carmen,Manabi,C,3,2016-05-16,755,Event,National,Ecuador,Terremoto Manabi+30,False

In [34]:
len(eq_store_holiday)

1908

In [23]:
#Read in the emissions data file 
oil_file = "resources/oil.csv"
oil_df = pd.read_csv(oil_file)
oil_df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [24]:
# drop null values from oil dataframe/csv
cleaned_oil=oil_df.dropna()
cleaned_oil.head()

         date  dcoilwtico
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20
5  2013-01-08       93.21

In [25]:
cleaned_oil['date'] = pd.to_datetime(cleaned_oil['date'])
cleaned_oil.dtypes

/var/folders/bp/kkf4c1nj557c5frmyn420c7c0000gn/T/ipykernel_23242/3394931503.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_oil['date'] = pd.to_datetime(cleaned_oil['date'])

date          datetime64[ns]
dcoilwtico           float64
dtype: object

In [26]:
final_df = pd.merge(eq_store_holiday, cleaned_oil, on ='date')
final_df.head()

,store_nbr,city,state,type_x,cluster,date,transactions,type_y,locale,locale_name,description,transferred,dcoilwtico
0,1,Quito,Pichincha,D,13,2016-04-18,2133,Event,National,Ecuador,Terremoto Manabi+2,False,39.74
1,2,Quito,Pichincha,D,13,2016-04-18,2447,Event,National,Ecuador,Terremoto Manabi+2,False,39.74
2,3,Quito,Pichincha,D,8,2016-04-18,3621,Event,National,Ecuador,Terremoto Manabi+2,False,39.74
3,4,Quito,Pichincha,D,9,2016-04-18,1685,Event,National,Ecuador,Terremoto Manabi+2,False,39.74
4,5,Santo Domingo,Santo Domingo de los Tsachilas,D,4,2016-04-18,1297,Event,National,Ecuador,Terremoto Manabi+2,False,39.74

In [27]:
len(final_df)

1219

In [35]:
#Create SQL Alchemy engine to postgres database "IMDB_db"
protocol = 'postgresql'
username = 'postgres'
password = '0206Teddy'
host = 'localhost'
port = 5432
database_name = 'grocery'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)

In [36]:
#show the existing table names in the database
engine.table_names()

/var/folders/bp/kkf4c1nj557c5frmyn420c7c0000gn/T/ipykernel_23242/2549929793.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

[]